In [3]:
import pandas as pd
data = ['a','r','y','a','n']
ser= pd.Series(data)
ser

0    a
1    r
2    y
3    a
4    n
dtype: object

In [5]:
ser= pd.Series(data, index=['u', 'v', 'w', 'x', 'y'])
ser

u    a
v    r
w    y
x    a
y    n
dtype: object

In [10]:
data1 = {'g':"1", 'e':"2", 'r':"3"}
df= pd.DataFrame(data1, index=['values'])
df

        g  e  r
values  1  2  3

In [4]:
dict = {
  'item': ["pen", "pencil", "box"],
  'qty': [3, 7, 2]
}

df=pd.DataFrame(dict,index=["item1","item2","item3"])
# df = pd.DataFrame(dict)
df

         item  qty
item1     pen    3
item2  pencil    7
item3     box    2

## loc: Uses row and column labels. 
## iloc: Uses integer-based row and column indices (starting from 0)

In [22]:
df.iloc[0]

item    pen
qty       3
Name: item1, dtype: object

In [23]:
df.loc['item2', 'item']

'pencil'

In [25]:
df.iloc[1:3]

         item  qty
item2  pencil    7
item3     box    2

In [27]:
df['qty']

item1    3
item2    7
item3    2
Name: qty, dtype: int64

In [12]:
df.at['item1', 'qty']

3

In [34]:
import pandas as pd
import numpy as np
data = {'Name': ['Prabhas', 'Aman', 'Shiva', 'Aryan'],
        'Height': [1, 2, np.NAN, 4],
        'Qualification': ['A', 'B', 'C', 'D']}

df = pd.DataFrame(data)
display(df)

      Name  Height Qualification
0  Prabhas     1.0             A
1     Aman     2.0             B
2    Shiva     NaN             C
3    Aryan     4.0             D

In [35]:
address = ['Delhi', 'Agra', 'Mathura', np.NAN]
df['Address'] = address

display(df)

      Name  Height Qualification  Address
0  Prabhas     1.0             A    Delhi
1     Aman     2.0             B     Agra
2    Shiva     NaN             C  Mathura
3    Aryan     4.0             D      NaN

In [36]:
df.insert(2, "Age", [21, 23, 24, 21], True)
display(df)

      Name  Height  Age Qualification  Address
0  Prabhas     1.0   21             A    Delhi
1     Aman     2.0   23             B     Agra
2    Shiva     NaN   24             C  Mathura
3    Aryan     4.0   21             D      NaN

In [37]:
df = df.assign(address = ['Delhi', 'Agra', 'Mathura', 'Fbd'])
df

      Name  Height  Age Qualification  Address  address
0  Prabhas     1.0   21             A    Delhi    Delhi
1     Aman     2.0   23             B     Agra     Agra
2    Shiva     NaN   24             C  Mathura  Mathura
3    Aryan     4.0   21             D      NaN      Fbd

In [38]:
df.drop(columns=["address"], axis=1, inplace=True)
df

      Name  Height  Age Qualification  Address
0  Prabhas     1.0   21             A    Delhi
1     Aman     2.0   23             B     Agra
2    Shiva     NaN   24             C  Mathura
3    Aryan     4.0   21             D      NaN

In [39]:
for index, row in df.iterrows():
    print(index,row)
    print()

0 Name             Prabhas
Height               1.0
Age                   21
Qualification          A
Address            Delhi
Name: 0, dtype: object

1 Name             Aman
Height            2.0
Age                23
Qualification       B
Address          Agra
Name: 1, dtype: object

2 Name               Shiva
Height               NaN
Age                   24
Qualification          C
Address          Mathura
Name: 2, dtype: object

3 Name             Aryan
Height             4.0
Age                 21
Qualification        D
Address            NaN
Name: 3, dtype: object

In [40]:
df.isnull().sum()

Name             0
Height           1
Age              0
Qualification    0
Address          1
dtype: int64

In [49]:
df.fillna(method='pad', inplace=True) 
df

      Name  Height  Age Qualification  Address  Marks
0  Prabhas     1.0   21             A    Delhi    7.0
1     Aman     2.0   23             B     Agra    8.0
2    Shiva     2.0   24             C  Mathura    8.0
3    Aryan     4.0   21             D  Mathura    9.0

In [51]:
df["Marks"]=[7,8,np.NAN,9]
df

      Name  Height  Age Qualification  Address  Marks
0  Prabhas     1.0   21             A    Delhi    7.0
1     Aman     2.0   23             B     Agra    8.0
2    Shiva     2.0   24             C  Mathura    NaN
3    Aryan     4.0   21             D  Mathura    9.0

In [52]:
df.dropna(axis=1)

      Name  Height  Age Qualification  Address
0  Prabhas     1.0   21             A    Delhi
1     Aman     2.0   23             B     Agra
2    Shiva     2.0   24             C  Mathura
3    Aryan     4.0   21             D  Mathura

In [ ]:
#df.dropna()
#df.dropna(axis=1)
#df.dropna(how='all')
#df.dropna(axis=0, how='any')


#  Mean, Median, and Mode Imputation
# df.fillna({"Marks":df['Marks'].mean()},inplace=True)
#df['Marks'].fillna(df['Marks'].median(),inplace=True)
#df['Marks'].fillna(df['Marks'].mode().iloc[0])

In [1]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [24, 27, 22, 32, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Score': [85, 90, 78, 88, 95]
}

df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)

print("\nDescribe mathod:")
print(df.describe())

print("\nPeople with score greater than 85:")
print(df[df['Score'] > 85])

new_row = {'Name': 'Frank', 'Age': 26, 'City': 'Seattle', 'Score': 82}
df.loc[len(df)] = new_row

print("\nAfter adding a new row:")
print(df)

df.drop(columns=['City'], inplace=True)

print("\nAfter deleting 'City' column:")
print(df)

Original DataFrame:
      Name  Age         City  Score
0    Alice   24     New York     85
1      Bob   27  Los Angeles     90
2  Charlie   22      Chicago     78
3    David   32      Houston     88
4      Eva   29      Phoenix     95

Describe mathod:
             Age      Score
count   5.000000   5.000000
mean   26.800000  87.200000
std     3.962323   6.300794
min    22.000000  78.000000
25%    24.000000  85.000000
50%    27.000000  88.000000
75%    29.000000  90.000000
max    32.000000  95.000000

People with score greater than 85:
    Name  Age         City  Score
1    Bob   27  Los Angeles     90
3  David   32      Houston     88
4    Eva   29      Phoenix     95

After adding a new row:
      Name  Age         City  Score
0    Alice   24     New York     85
1      Bob   27  Los Angeles     90
2  Charlie   22      Chicago     78
3    David   32      Houston     88
4      Eva   29      Phoenix     95
5    Frank   26      Seattle     82

After deleting 'City' column:
      Name  Age  Score
0    Alice   24     85
1      Bob   27     90
2  Charlie   22     78
3    David   32     88
4      Eva   29     95
5    Frank   26     82